esp8266/Arduino/hardware/google/sam/boards.txt
##############################################################

arduino_due_u.name=Google DueU Dev. Ed.
arduino_due_u.upload.tool=bossac
arduino_due_u.upload.protocol=sam-ba
arduino_due_u.upload.maximum_size=49152
arduino_due_u.build.mcu=cortex-m3
arduino_due_u.build.f_cpu=84000000L
arduino_due_u.build.core=arduino:sam
arduino_due_u.build.extra_flags=-D__SAM3U4E__ -mthumb 
arduino_due_u.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_u.build.variant=arduino_due_u
arduino_due_u.build.variant_system_lib=libsam_sam3u4e_gcc_rel.a

##############################################################

arduino_due_x.name=Google DueX Dev. Ed.
arduino_due_x.upload.tool=bossac
arduino_due_x.upload.protocol=sam-ba
arduino_due_x.upload.maximum_size=49152
arduino_due_x.build.mcu=cortex-m3
arduino_due_x.build.f_cpu=96000000L
arduino_due_x.build.core=arduino:sam
arduino_due_x.build.extra_flags=-D__SAM3X8E__ -mthumb 
arduino_due_x.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_x.build.variant=arduino_due_x
arduino_due_x.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
